app/controllers/game_controller.rb

  def index
    @button_id=request[:button_id]
    puts @button_id
    @questions=Question.where subgenre_id:@button_id
    @subgenres=Subgenre.find_by id:@button_id
    puts @subgenres.name
    $i+=1
    puts $i
    if ($i==3)
      $i=0
      a= current_user.score
      current_user.score=0
      current_user.save
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`subgenre_id` IS NULL
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`subgenre_id` = '1' LIMIT 1
UPDATE `users` SET `score` = 0, `updated_at` = '2017-09-19 21:03:11' WHERE `users`.`id` = 1

  def first
    @button_id=params[:index]
    @questions=Question.where subgenre_id:@button_id
    @subgenres=Subgenre.find_by id:@button_id
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`subgenre_id` IS NULL
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` IS NULL LIMIT 1

  def submit
  	val=[params[:choice1], params[:choice2], params[:choice3], params[:choice4]].join(";")
    val_index=params[:index]
    id=params[:sub]
    @questions=Question.where subgenre_id:id
    puts @questions[val_index.to_i].answer
    puts val
  	if (val==@questions[val_index.to_i].answer)
      puts "kdkjnknksk"
       redirect_to :action =>'index', :button_id => id
       current_user.score+=1
       current_user.save
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`subgenre_id` = 0
UPDATE `users` SET `score` = 1, `updated_at` = '2017-09-19 18:56:27' WHERE `users`.`id` = 1